In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl (11.6 MB)
     --------------------------------------- 11.6/11.6 MB 15.6 MB/s eta 0:00:00
Collecting numpy>=1.23.2
  Downloading numpy-2.2.5-cp311-cp311-win_amd64.whl (12.9 MB)
     --------------------------------------- 12.9/12.9 MB 28.5 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\program files\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\program files\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\program files\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\program files\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: numpy, pandas
Successfully installed numpy-2.2.5 pandas-2.2.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 25.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
df = pd.read_csv("nyc_weather.csv")

In [4]:
df.count()

EST                     31
Temperature             31
DewPoint                31
Humidity                31
Sea Level PressureIn    31
VisibilityMiles         31
WindSpeedMPH            28
PrecipitationIn         31
CloudCover              31
Events                   9
WindDirDegrees          31
dtype: int64

In [8]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [9]:
df.dtypes

EST                      object
Temperature               int64
DewPoint                  int64
Humidity                  int64
Sea Level PressureIn    float64
VisibilityMiles           int64
WindSpeedMPH            float64
PrecipitationIn          object
CloudCover                int64
Events                   object
WindDirDegrees            int64
dtype: object

In [10]:
df.Events.unique()

array([nan, 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

In [11]:
df.Events.describe()

count        9
unique       3
top       Rain
freq         4
Name: Events, dtype: object

In [14]:
df.Events

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8         Rain
9         Rain
10         NaN
11         NaN
12         NaN
13         NaN
14         NaN
15        Rain
16    Fog-Snow
17        Snow
18         NaN
19         NaN
20         NaN
21        Snow
22    Fog-Snow
23        Snow
24         NaN
25         NaN
26        Rain
27         NaN
28         NaN
29         NaN
30         NaN
Name: Events, dtype: object

In [15]:
# get the maximum temperature
df['Temperature'].max()

np.int64(50)

In [16]:
df.Temperature.min()

np.int64(20)

In [17]:
df1 = df['Temperature'] > 30
df1
df1.sum()
#total no. of temperature more than 30

np.int64(22)

In [23]:
#to know which day it rains
df['EST'][df['Events'] == 'Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [25]:
df['EST'][df['Humidity'] == 70]
df['EST'][df['Humidity']>=70]
df['EST'][df['WindSpeedMPH']==7.0]

1      1/2/2016
15    1/16/2016
25    1/26/2016
26    1/27/2016
29    1/30/2016
Name: EST, dtype: object

In [27]:
df.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [28]:
df.WindSpeedMPH.isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21     True
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
Name: WindSpeedMPH, dtype: bool

In [29]:
print(pd.__version__)

2.2.3

In [ ]:
#in pandas programming we can store the data in 2 types of data structures. they are:
#series
#dataframe

In [32]:
lst = [10,20,30,40,50,60]
s = pd.Series(lst)
print(s,type(s))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64 <class 'pandas.core.series.Series'>

In [33]:
l1 = [1,2,3]
ser = pd.Series(l1,index=['1st',2,'3rd'],name='c1')
print(ser)

1st    1
2      2
3rd    3
Name: c1, dtype: int64

In [35]:
s = pd.Series([10,20,30,40,50,60])
print(s,type(s))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64 <class 'pandas.core.series.Series'>

In [36]:
print(s.loc[0:4])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [39]:
lst = (10,20,30,40,50,60)
s = pd.Series(lst,dtype = 'float32')
print(s,type(s))

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
5    60.0
dtype: float32 <class 'pandas.core.series.Series'>

In [40]:
s[3]

np.float32(40.0)

In [41]:
s.shape

(6,)

In [43]:
lst = [10,'abcd',34.56,'Author']
s = pd.Series(lst,index=["Stno","name","marks","desg"])
print(s,type(s))

Stno         10
name       abcd
marks     34.56
desg     Author
dtype: object <class 'pandas.core.series.Series'>

In [44]:
s['Stno']

10

In [45]:
d1 = {"sub1":"Python","sub2":"Java","sub3":"data science","sub4":"ML"}
print(d1,type(d1))

{'sub1': 'Python', 'sub2': 'Java', 'sub3': 'data science', 'sub4': 'ML'} <class 'dict'>

In [46]:
d1.items()

dict_items([('sub1', 'Python'), ('sub2', 'Java'), ('sub3', 'data science'), ('sub4', 'ML')])

In [47]:
d1.keys()

dict_keys(['sub1', 'sub2', 'sub3', 'sub4'])

In [49]:
d1.values()

dict_values(['Python', 'Java', 'data science', 'ML'])

In [51]:
d1 = {"sub1":"python"}
s = pd.Series(d1)
print(s)

sub1    python
dtype: object

In [52]:
s["sub1"]

'python'

In [53]:
import numpy as np

In [54]:
nu = np.array([1,2,3])
pd.Series(nu)

0    1
1    2
2    3
dtype: int64

In [55]:
#creating an object dataframe by using list/tuple

In [56]:
lst = [[1,8,1,3],[10,20,30,0],[10,20,30,40]]
df = pd.Series(lst)
print(df)

0        [1, 8, 1, 3]
1     [10, 20, 30, 0]
2    [10, 20, 30, 40]
dtype: object

In [58]:
lst = [[10,'RS'],[20,'JG'],[30,'MCK'],[40,'TRA']]
df = pd.DataFrame(lst)
print(df)

    0    1
0  10   RS
1  20   JG
2  30  MCK
3  40  TRA

In [59]:
df.iloc[1:,:]

    0    1
1  20   JG
2  30  MCK
3  40  TRA

In [60]:
df.iloc[3,1]

'TRA'

In [ ]:
lst = [[10,'RS'],[20,'JG']]
df = pd.DataFrame(lst,columns=)

In [63]:
tpl = (("Rossum",75),("Gosling",85))
df = pd.DataFrame(tpl,index=[1,'@'],columns=['Name','Age'])
print(df)

      Name  Age
1   Rossum   75
@  Gosling   85

In [64]:
#creating an object DataFrame by using dict object

In [67]:
dictdata = {"Names":["Rossum","Gosling"],"subjects":["python","java"],"Ages":[65,80]}
print(dictdata)

{'Names': ['Rossum', 'Gosling'], 'subjects': ['python', 'java'], 'Ages': [65, 80]}

In [70]:
df.shape

(2, 3)

In [72]:
df = pd.DataFrame(dictdata,index=[1,'e'])
print(df)

     Names subjects  Ages
1   Rossum   python    65
e  Gosling     java    80

In [73]:
#creating an object DataFrame by using series object"

In [74]:
l1 = [10,20,30,40]
sdata = pd.Series(l1)
print(sdata)

0    10
1    20
2    30
3    40
dtype: int64

In [75]:
df = pd.DataFrame(sdata,columns=["number"])
print(df)

   number
0      10
1      20
2      30
3      40

In [77]:
df.shape

(4, 1)

In [78]:
type(df)

pandas.core.frame.DataFrame

In [79]:
d1 = {"totmark":[100,110,120,130],"ExtMarks":[80,75,65,90]}
df = pd.DataFrame(d1,index=[1,2,3,4])
(df)

   totmark  ExtMarks
1      100        80
2      110        75
3      120        65
4      130        90

In [80]:
df.iloc[3:,:]

   totmark  ExtMarks
4      130        90

In [81]:
#adding new column name to data frame

In [83]:
df['c3'] = df['totmark'] + df['ExtMarks']
df

   totmark  ExtMarks   c3
1      100        80  180
2      110        75  185
3      120        65  185
4      130        90  220

In [84]:
df['sub'] = df['totmark'] - df['ExtMarks']
df

   totmark  ExtMarks   c3  sub
1      100        80  180   20
2      110        75  185   35
3      120        65  185   55
4      130        90  220   40

In [85]:
df['new colum'] = [1,2,3,4]

In [86]:
df

   totmark  ExtMarks   c3  sub  new colum
1      100        80  180   20          1
2      110        75  185   35          2
3      120        65  185   55          3
4      130        90  220   40          4

In [87]:
df['new data'] = ['1st','2nd','3rd','4th']
df

   totmark  ExtMarks   c3  sub  new colum new data
1      100        80  180   20          1      1st
2      110        75  185   35          2      2nd
3      120        65  185   55          3      3rd
4      130        90  220   40          4      4th

In [88]:
df['Roll_NO1'] = range(1,5)
df

   totmark  ExtMarks   c3  sub  new colum new data  Roll_NO1
1      100        80  180   20          1      1st         1
2      110        75  185   35          2      2nd         2
3      120        65  185   55          3      3rd         3
4      130        90  220   40          4      4th         4

In [89]:
df = df[['Roll_NO1','totmark','ExtMarks','new data']]
df

   Roll_NO1  totmark  ExtMarks new data
1         1      100        80      1st
2         2      110        75      2nd
3         3      120        65      3rd
4         4      130        90      4th

In [90]:
df1 = df[['Roll_NO1','totmark']]
df1

   Roll_NO1  totmark
1         1      100
2         2      110
3         3      120
4         4      130

In [91]:
#sorting the dataframe

In [93]:
df = df.sort_values(["Roll_NO1"],ascending=True)
df

   Roll_NO1  totmark  ExtMarks new data
1         1      100        80      1st
2         2      110        75      2nd
3         3      120        65      3rd
4         4      130        90      4th

In [94]:
df = df.sort_values(["Roll_NO1"],ascending=False)
df

   Roll_NO1  totmark  ExtMarks new data
4         4      130        90      4th
3         3      120        65      3rd
2         2      110        75      2nd
1         1      100        80      1st

In [95]:
pip install scipy

Collecting scipy
  Downloading scipy-1.15.2-cp311-cp311-win_amd64.whl (41.2 MB)
     --------------------------------------- 41.2/41.2 MB 11.5 MB/s eta 0:00:00
Requirement already satisfied: numpy<2.5,>=1.23.5 in c:\program files\python311\lib\site-packages (from scipy) (2.2.5)
Installing collected packages: scipy
Successfully installed scipy-1.15.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 25.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [98]:
import pandas as pd
df = pd.read_csv("IPL Matches 2008-2020.csv")

In [99]:
df.isnull().sum()

id                   0
city                13
date                 0
player_of_match      4
venue                0
neutral_venue        0
team1                0
team2                0
toss_winner          0
toss_decision        0
winner               4
result               4
result_margin       17
eliminator           4
method             797
umpire1              0
umpire2              0
dtype: int64

In [100]:
#astype - it is used to change from one datatype to another

df['id'] = df['id'].astype('float')
df.dtypes

id                 float64
city                object
date                object
player_of_match     object
venue               object
neutral_venue        int64
team1               object
team2               object
toss_winner         object
toss_decision       object
winner              object
result              object
result_margin      float64
eliminator          object
method              object
umpire1             object
umpire2             object
dtype: object

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    float64
 1   city             803 non-null    object
 2   date             816 non-null    object
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: float64(2), int64(1), object(14)
memory usage: 108.5+ KB

In [102]:
df.isnull().sum()

id                   0
city                13
date                 0
player_of_match      4
venue                0
neutral_venue        0
team1                0
team2                0
toss_winner          0
toss_decision        0
winner               4
result               4
result_margin       17
eliminator           4
method             797
umpire1              0
umpire2              0
dtype: int64

In [103]:
df['method'] = df['method'].fillna('Dubai')
df

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982.0,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,Dubai,Asad Rauf,RE Koertzen
1,335983.0,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,Dubai,MR Benson,SL Shastri
2,335984.0,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,Dubai,Aleem Dar,GA Pratapkumar
3,335985.0,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,Dubai,SJ Davis,DJ Harper
4,335986.0,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,Dubai,BF Bowden,K Hariharan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
811,1216547.0,Dubai,2020-09-28,AB de Villiers,Dubai International Cricket Stadium,0,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,field,Royal Challengers Bangalore,tie,NaN,Y,Dubai,Nitin Menon,PR Reiffel
812,1237177.0,Dubai,2020-11-05,JJ Bumrah,Dubai International Cricket Stadium,0,Mumbai Indians,Delhi Capitals,Delhi Capitals,field,Mumbai Indians,runs,57.0,N,Dubai,CB Gaffaney,Nitin Menon
813,1237178.0,Abu Dhabi,2020-11-06,KS Williamson,Sheikh Zayed Stadium,0,Royal Challengers Bangalore,Sunrisers Hyderabad,Sunrisers Hyderabad,field,Sunrisers Hyderabad,wickets,6.0,N,Dubai,PR Reiffel,S Ravi
814,1237180.0,Abu Dhabi,2020-11-08,MP Stoinis,Sheikh Zayed Stadium,0,Delhi Capitals,Sunrisers Hyderabad,Delhi Capitals,bat,Delhi Capitals,runs,17.0,N,Dubai,PR Reiffel,S Ravi
815,1237181.0,Dubai,2020-11-10,TA Boult,Dubai International Cricket Stadium,0,Delhi Capitals,Mumbai Indians,Delhi Capitals,bat,Mumbai Indians,wickets,5.0,N,Dubai,CB Gaffaney,Nitin Menon

In [105]:
import pandas as pd

# Sample DataFrames
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Age': [25, 30, 22]})

# Merge on 'ID' column
merged_df = pd.merge(df1, df2, on='ID', how='left')  # Options: 'inner', 'left', 'right', 'outer'

print(merged_df)

   ID     Name   Age
0   1    Alice  25.0
1   2      Bob  30.0
2   3  Charlie   NaN

In [106]:
df.head()

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982.0,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,Dubai,Asad Rauf,RE Koertzen
1,335983.0,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,Dubai,MR Benson,SL Shastri
2,335984.0,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,Dubai,Aleem Dar,GA Pratapkumar
3,335985.0,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,Dubai,SJ Davis,DJ Harper
4,335986.0,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,Dubai,BF Bowden,K Hariharan